robdobsn/MicroPythonESP32Embedding/components/micropython/ports/ric/boards/ric2/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "RIC2"
#define MICROPY_HW_MCU_NAME "ESP32"
